<template>
	<img :src="require('@/assets/'+$route.query.num+'.png')">
	<h1>{{data[$route.query.num]}}</h1>
</template>

<script>
	export default{
		name:'Button',
		
		setup(){
			let data = ['0','孙京川，河北邯郸人，中共党员，著名靳学家，plxjj爱好者，本硕就读于西安交通大学信通学院。孙京川曾获中兴一等奖，曾任电信67心理委员，现任s0074&s0075班长，多次婉拒担任党支书。孙京川是lol郊区的癌症晚期AD选手，平日喜好“安排”，曾多次做出“xx前不再安排”、“要减肥”承诺，真香无一例外，导致大一到大四体重飙升，判若两人。孙京川大一到研一试图恋爱，均以失败告终，令人唏嘘不已。',
			'张栋，陕西咸阳人，张栋同学在本科期间获得校级三等奖学金，2018数学建模省一，跟随舞团，参加过交大之星，文治达人，崇实之光，研究生迎新晚会等。现在创新港读研，入选百度菁英班，2020年获得亚太数学建模国家二等奖，现为预备党员，担任班级团支书。zd这个逼和女朋友小王，吵闹无数，分分合合，给聚义厅兄弟们吐过无数次苦水，但其口是心非，已经和小王牢牢地绑在了一起。',
			'崔毅林，吉林延边人，朝鲜族，本硕就读于西安交通大学微电子学院。四语（英语，汉语，朝鲜语，日语）天才，游泳大师，梗文化深谙者，手办爱好者，FF14骨灰级游戏玩家。崔毅林同志是微电子学院的传说，其所著大作业实验报告与考试题流传甚广。谈起崔毅林，总绕不开其政见，理性自由又现实，是党员群众永远的好伙伴。崔毅林的同门安磊、廷廷，为聚义厅兄弟们所熟知，其原因不得而知。',	
			'来自陕西西安，中共党员，本科就读于西安交通大学钱学森班电气工程专业，保研本校读研，研究生期间担任电气S0045班班长，就读于西安交通大学创新港研究生一年级的学生李锴英报名参加了第十四届全运会小轮车项目赛会志愿者。他担任观众服务处的服务工作，为观众提供场馆引导、信息咨询等服务，在第十四届全国运动会小轮车项目测试赛开赛的日子，李锴英自豪的说：“当小轮车场馆迎来了第一批观众时，能为广大观众提供服务我感到非常荣幸，同时这次志愿服务也彰显了我们交大青年的时代风貌与精神风采！”',
			'高度决定视野，角度改变观念，尺度把握人生，态度关乎一切。来自陕西咸阳，本硕博均就读于西安交通大学核工程专业，科研拔尖人才。主要从事新型热管核动力反应堆的传热传质、系统瞬态耦合、安全分析 方向研究工作。研一期间，作为学生第一负责人和骨干独立承担3个横向课题，并且承担了科技部重点研发项目的2个子课题，参与课题总经费1100余万元。解决了热管反应堆系统计算、虚拟仿真、运行控制及安全分析等方面的实际工程问题，形成国内首个热管反应堆全系统虚拟仿真平台。以第一作者身份发表SCI论文2篇，EI2篇，申请专利2项，软件著作权2项。在社会工作方面，担任硕0031党支部支部书记，组织支部参加多项学院活动，积极进行支部党建工作，获优秀学生干部表彰。',
			'管中天，浙江台州人，本科就读于西安交通大学信息工程专业，现就职于国网台州供电公司。我的目光所及都是你，在这纵横交错的世间，唯有你始终守护着我直达心灵的门户。',
			'武涛，山西孝义人，为人忠厚，朋友甚多，为人类的好朋友，本硕就读于西安交通大学材料学院。武涛的名言与表情包甚多，比如自己吃去吧，人类著名现象涛化的创始人祖师爷。涛，喜爱并擅长玩英雄联盟，仅有两条朋友圈，且都与lpl夺冠相关，被誉为交大第一adc，改变adc的人。现如今也在峡谷挥洒着汗水。',
			'梁洪玮，男，汉族，中共党员，山西孝义人，著名沈学家。研究生（推免）期间在电子与信息学部微电子学院集成电路设计专业就读。2020年为西安交通大学第二十二届研究生支教团云南分队成员。曾任西安交通大学文治书院党总支副书记、文治书院学生党建办公室副主任、文治书院学生第四党支部书记、文治书院16级团总支书记以及班级团支书。本科期间赴香港理工大学参加暑期国际学校并获得奖学金。多次参加社会实践和志愿活动。梁洪玮现在西安交通大学微电子学院张鸿导师的指导下读研，担任班级党支书。梁老师红颜甚多，每段时间喜欢者又不同，深得女同志暗地里的评价。梁书记喜爱烟酒茶，其喜爱程度可谓交大第一。',
			'乔冠霖，山东威海人，本科就读于西安交通大学信息工程学院，硕士跨专业就读于交大微电子学院，现研究方向为软件开发，是聚义厅众兄弟中跨行掌握专业技能最多的男人。预备党员乔冠霖同志，是聚义厅中最为清醒的人，研一开学便认清了社会现实——宇宙的尽头是考公。并为之不断努力，誓要在官员辈出山东省做一名坚定为人民服务的公务员。乔冠霖同志作息规律——本科与硕士期间最晚凌晨1点睡，最晚早上9点起，晚上9点下班，雷打不动。'
			]
			
			return {data,}
		
		}
	} 
</script>

<style>
</style>
